tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
#include "server_network_sta.h"

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_err.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "esp_timer.h"
#include "esp_wifi.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "mdns.h"
#include "nvs.h"

#include "file_serving_example_common.h"
#include "ble_data_handler.h"
#include "ch583_wifi_uart_protocol.h"
#include "led_status.h"

typedef struct {
    char ssid[33];
    char password[65];
    bool is_valid;
} wifi_credential_t;

static const char *TAG = "server_network_sta";
static EventGroupHandle_t s_sta_event_group;
static bool s_wifi_handlers_registered;
static bool s_mdns_service_started;
static bool s_file_server_started;
static esp_event_handler_instance_t s_wifi_event_instance;
static esp_event_handler_instance_t s_ip_event_instance;
static esp_timer_handle_t s_wifi_retry_timer;
static int s_wifi_connect_retry_num;
static TickType_t s_wifi_connect_start_tick;
static bool s_wifi_connect_active;
static bool s_wifi_scan_before_connect;

#define SERVER_NETWORK_STA_CONNECT_RETRY_MAX 10
#define SERVER_NETWORK_STA_CONNECT_RETRY_BASE_DELAY_MS 100  // 500
#define SERVER_NETWORK_STA_CONNECT_RETRY_MAX_DELAY_MS 100  // 2000
#define SERVER_NETWORK_STA_CONNECT_START_DELAY_MS 5   // 500
#define SERVER_NETWORK_STA_SCAN_BEFORE_CONNECT 0
#define SERVER_NETWORK_STA_INIT_RETRY_ROUNDS 3
#define SERVER_NETWORK_STA_INIT_RETRY_DELAY_MS 100  // 2000
#define SERVER_NETWORK_STA_CONNECTED_PS WIFI_PS_MAX_MODEM

static const char *wifi_disconnect_reason_name(int reason);

static void server_network_sta_set_ps(wifi_ps_type_t ps_type, const char *stage)
{
    esp_err_t ret = esp_wifi_set_ps(ps_type);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "WiFi PS set stage=%s type=%d", stage != NULL ? stage : "<null>", (int)ps_type);
    } else {
        ESP_LOGW(TAG, "WiFi PS set failed stage=%s type=%d ret=%s",
                 stage != NULL ? stage : "<null>", (int)ps_type, esp_err_to_name(ret));
    }
}

static bool server_network_sta_connect_window_expired(void)
{
    if (s_wifi_connect_start_tick == 0) {
        return false;
    }

    TickType_t elapsed = xTaskGetTickCount() - s_wifi_connect_start_tick;
    return elapsed >= pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_TIMEOUT_MS);
}

static uint32_t server_network_sta_retry_delay_ms(void)
{
    uint32_t delay_ms = SERVER_NETWORK_STA_CONNECT_RETRY_BASE_DELAY_MS *
                        (uint32_t)(s_wifi_connect_retry_num + 1);
    if (delay_ms > SERVER_NETWORK_STA_CONNECT_RETRY_MAX_DELAY_MS) {
        delay_ms = SERVER_NETWORK_STA_CONNECT_RETRY_MAX_DELAY_MS;
    }
    return delay_ms;
}

static void server_network_sta_retry_timer_cb(void *arg)
{
    (void)arg;

    if (!s_wifi_connect_active) {
        return;
    }
    if (server_network_sta_connect_window_expired()) {
        ESP_LOGW(TAG, "WiFi retry window expired, set fail");
        if (s_sta_event_group != NULL) {
            xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_FAIL_BIT);
        }
        return;
    }

    server_network_sta_set_ps(WIFI_PS_NONE, "retry_connect");
    esp_err_t ret = esp_wifi_connect();
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
        ESP_LOGE(TAG, "esp_wifi_connect delayed retry failed: %s", esp_err_to_name(ret));
        if (s_sta_event_group != NULL) {
            xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_FAIL_BIT);
        }
    }
}

static void server_network_sta_stop_retry_timer(void)
{
    if (s_wifi_retry_timer != NULL) {
        (void)esp_timer_stop(s_wifi_retry_timer);
    }
}

static void server_network_sta_ensure_retry_timer(void)
{
    if (s_wifi_retry_timer != NULL) {
        return;
    }

    const esp_timer_create_args_t timer_args = {
        .callback = server_network_sta_retry_timer_cb,
        .name = "sta_retry",
    };
    esp_err_t ret = esp_timer_create(&timer_args, &s_wifi_retry_timer);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "create WiFi retry timer failed: %s", esp_err_to_name(ret));
    }
}

static void server_network_sta_schedule_retry(int reason)
{
    server_network_sta_ensure_retry_timer();
    if (s_wifi_retry_timer == NULL || s_sta_event_group == NULL) {
        if (s_sta_event_group != NULL) {
            xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_FAIL_BIT);
        }
        return;
    }

    if (server_network_sta_connect_window_expired() ||
        s_wifi_connect_retry_num >= SERVER_NETWORK_STA_CONNECT_RETRY_MAX) {
        ESP_LOGW(TAG,
                 "WiFi retry exhausted reason=%d(%s) retry=%d/%d",
                 reason,
                 wifi_disconnect_reason_name(reason),
                 s_wifi_connect_retry_num,
                 SERVER_NETWORK_STA_CONNECT_RETRY_MAX);
        xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_FAIL_BIT);
        return;
    }

    uint32_t delay_ms = server_network_sta_retry_delay_ms();
    s_wifi_connect_retry_num++;
    server_network_sta_stop_retry_timer();
    esp_err_t ret = esp_timer_start_once(s_wifi_retry_timer, (uint64_t)delay_ms * 1000ULL);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "start WiFi retry timer failed: %s", esp_err_to_name(ret));
        xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_FAIL_BIT);
        return;
    }

    ESP_LOGW(TAG,
             "WiFi retry scheduled reason=%d(%s) retry=%d/%d delay_ms=%lu",
             reason,
             wifi_disconnect_reason_name(reason),
             s_wifi_connect_retry_num,
             SERVER_NETWORK_STA_CONNECT_RETRY_MAX,
             (unsigned long)delay_ms);
}

static void __attribute__((unused)) server_network_sta_scan_target_ssid(const char *ssid)
{
    if (ssid == NULL || ssid[0] == '\0') {
        return;
    }

    wifi_scan_config_t scan_config = {
        .ssid = (uint8_t *)ssid,
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
        .scan_time.active.min = 100,
        .scan_time.active.max = 300,
    };

    esp_err_t ret = esp_wifi_scan_start(&scan_config, true);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WiFi scan skip ret=%s", esp_err_to_name(ret));
        return;
    }

    uint16_t ap_count = 4;
    wifi_ap_record_t ap_records[4] = {0};
    ret = esp_wifi_scan_get_ap_records(&ap_count, ap_records);
    if (ret != ESP_OK || ap_count == 0) {
        ESP_LOGW(TAG, "WiFi scan no hit ret=%s count=%u",
                 esp_err_to_name(ret), (unsigned int)ap_count);
        return;
    }

    wifi_ap_record_t *best = &ap_records[0];
    for (uint16_t i = 1; i < ap_count; i++) {
        if (ap_records[i].rssi > best->rssi) {
            best = &ap_records[i];
        }
    }

