tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
    ESP_LOGI(TAG,
             "WiFi scan hit bssid=%02x:%02x:%02x:%02x:%02x:%02x ch=%u rssi=%d auth=%d",
             best->bssid[0], best->bssid[1], best->bssid[2],
             best->bssid[3], best->bssid[4], best->bssid[5],
             best->primary, best->rssi, best->authmode);
}

static void parse_zero_terminated_blob(const uint8_t *blob_data, size_t blob_len, char *out, size_t out_size)
{
    size_t copy_len = 0;

    if (blob_data == NULL || out == NULL || out_size == 0) {
        return;
    }

    while (copy_len + 1 < out_size && copy_len < blob_len && blob_data[copy_len] != '\0') {
        out[copy_len] = (char)blob_data[copy_len];
        copy_len++;
    }
    out[copy_len] = '\0';
}

static esp_err_t read_nvs_blob_string(nvs_handle_t handle, const char *key, char *out, size_t out_size)
{
    size_t blob_len = 0;
    esp_err_t ret = nvs_get_blob(handle, key, NULL, &blob_len);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "read key=%s length failed: %s", key, esp_err_to_name(ret));
        return ret;
    }

    uint8_t *blob = (uint8_t *)malloc(blob_len);
    if (blob == NULL) {
        ESP_LOGE(TAG, "alloc key=%s blob failed len=%u", key, (unsigned int)blob_len);
        return ESP_ERR_NO_MEM;
    }

    ret = nvs_get_blob(handle, key, blob, &blob_len);
    if (ret == ESP_OK) {
        parse_zero_terminated_blob(blob, blob_len, out, out_size);
    }
    free(blob);
    return ret;
}

static esp_err_t read_nvs_string(nvs_handle_t handle, const char *key, char *out, size_t out_size)
{
    size_t len = out_size;
    esp_err_t ret = nvs_get_str(handle, key, out, &len);
    if (ret == ESP_OK) {
        out[out_size - 1] = '\0';
    } else {
        ESP_LOGW(TAG, "read wifi/%s failed: %s", key, esp_err_to_name(ret));
    }
    return ret;
}

static wifi_credential_t server_network_sta_read_saved_wifi(void)
{
    wifi_credential_t credential = {0};
    nvs_handle_t handle = 0;

    esp_err_t ret = nvs_open("wifi", NVS_READONLY, &handle);
    if (ret == ESP_OK) {
        esp_err_t ssid_ret = read_nvs_string(handle, "ssid", credential.ssid, sizeof(credential.ssid));
        esp_err_t pass_ret = read_nvs_string(handle, "password", credential.password, sizeof(credential.password));
        nvs_close(handle);
        if (ssid_ret == ESP_OK && pass_ret == ESP_OK && credential.ssid[0] != '\0') {
            credential.is_valid = true;
            ESP_LOGI(TAG, "WiFi credential ssid=%s password=%s",
                     credential.ssid, credential.password);
            return credential;
        }
    } else {
        ESP_LOGW(TAG, "open old wifi namespace failed: %s", esp_err_to_name(ret));
    }

    // Read the same STA credentials that ESP-IDF WiFi stores in nvs.net80211 for the Server Network STA path.
    ret = nvs_open("nvs.net80211", NVS_READONLY, &handle);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "open nvs.net80211 failed: %s", esp_err_to_name(ret));
        return credential;
    }

    ret = read_nvs_blob_string(handle, "sta.ssid", credential.ssid, sizeof(credential.ssid));
    if (ret != ESP_OK) {
        nvs_close(handle);
        return credential;
    }

    ret = read_nvs_blob_string(handle, "sta.pswd", credential.password, sizeof(credential.password));
    if (ret != ESP_OK) {
        nvs_close(handle);
        return credential;
    }

    nvs_close(handle);
    credential.is_valid = credential.ssid[0] != '\0';
    ESP_LOGI(TAG, "WiFi credential ssid=%s password=%s",
             credential.ssid, credential.password);
    return credential;
}

static const char *wifi_disconnect_reason_name(int reason)
{
    switch (reason) {
    case 1:
        return "UNSPECIFIED";
    case 2:
        return "AUTH_EXPIRE";
    case 4:
        return "INACTIVITY";
    case 8:
        return "ASSOC_LEAVE";
    case 14:
        return "MIC_FAILURE";
    case 15:
        return "4WAY_HANDSHAKE_TIMEOUT";
    case 16:
        return "GROUP_KEY_TIMEOUT";
    case 17:
        return "IE_DIFFERS";
    case 39:
        return "TIMEOUT";
    case 200:
        return "BEACON_TIMEOUT";
    case 201:
        return "NO_AP_FOUND";
    case 202:
        return "AUTH_FAIL";
    case 203:
        return "ASSOC_FAIL";
    case 204:
        return "HANDSHAKE_TIMEOUT";
    case 205:
        return "CONNECTION_FAIL";
    case 210:
        return "SECURITY_MISMATCH";
    default:
        return "UNKNOWN";
    }
}

static const char *wifi_disconnect_reason_hint(int reason)
{
    switch (reason) {
    case 15:
    case 202:
    case 204:
        return "password/security/rssi";
    case 201:
        return "ssid/channel/rssi";
    case 203:
    case 205:
        return "router/compat/rssi";
    case 200:
        return "weak-signal/router";
    case 210:
        return "authmode";
    default:
        return "check-router-log";
    }
}
static void server_network_sta_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id, void *event_data)
{
    (void)arg;

    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        if (s_wifi_scan_before_connect) {
            ESP_LOGI(TAG, "WiFi start wait scan");
            return;
        }
#if SERVER_NETWORK_STA_DEBUG_LOG_ENABLE
        ESP_LOGI(TAG, "WiFi start connect");
#endif
        server_network_sta_set_ps(WIFI_PS_NONE, "connecting");
        esp_err_t ret = esp_wifi_connect();
        if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
            ESP_LOGE(TAG, "esp_wifi_connect failed: %s", esp_err_to_name(ret));
        }
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {
        wifi_event_sta_connected_t *event = (wifi_event_sta_connected_t *)event_data;
#if SERVER_NETWORK_STA_DEBUG_LOG_ENABLE
        if (event != NULL) {
            ESP_LOGI(TAG, "WiFi connected ch=%u auth=%d bssid=%02x:%02x:%02x:%02x:%02x:%02x",
                     event->channel, event->authmode,
                     event->bssid[0], event->bssid[1], event->bssid[2],
                     event->bssid[3], event->bssid[4], event->bssid[5]);
        }
#endif
    } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "WiFi IP=" IPSTR, IP2STR(&event->ip_info.ip));
        wifi_ap_record_t ap_info = {0};
        if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
            ESP_LOGI(TAG,
                     "WiFi got_ip bssid=%02x:%02x:%02x:%02x:%02x:%02x ch=%u rssi=%d",
                     ap_info.bssid[0], ap_info.bssid[1], ap_info.bssid[2],
                     ap_info.bssid[3], ap_info.bssid[4], ap_info.bssid[5],
                     ap_info.primary, ap_info.rssi);
        }
        s_wifi_connect_active = false;
        server_network_sta_stop_retry_timer();
        server_network_sta_set_ps(SERVER_NETWORK_STA_CONNECTED_PS, "got_ip");
        s_wifi_connect_retry_num = 0;
        xEventGroupSetBits(s_sta_event_group, SERVER_NETWORK_STA_CONNECTED_BIT);
    } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *event = (wifi_event_sta_disconnected_t *)event_data;
        int reason = event ? event->reason : -1;
        if (!s_wifi_connect_active) {
            ESP_LOGI(TAG, "ignore inactive WiFi disconnected reason=%d(%s)",
                     reason, wifi_disconnect_reason_name(reason));
            return;
        }
        if (reason != 8) {
            ESP_LOGW(TAG, "WiFi disconnected reason=%d(%s) rssi=%d hint=%s",
                     reason, wifi_disconnect_reason_name(reason),
                     event ? event->rssi : 0, wifi_disconnect_reason_hint(reason));
        }
        server_network_sta_schedule_retry(reason);
    }
}

static uint8_t ServerPort_NetworkSTAInit(wifi_credential_t credential)
{
    if (!credential.is_valid) {
        return 0;
    }

    if (s_sta_event_group == NULL) {
        s_sta_event_group = xEventGroupCreate();
        if (s_sta_event_group == NULL) {
            ESP_LOGE(TAG, "create STA event group failed");
            return 0;
        }
    }

    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "esp_netif_init failed: %s", esp_err_to_name(ret));
        return 0;
    }

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (sta_netif == NULL) {
        sta_netif = esp_netif_create_default_wifi_sta();
        if (sta_netif == NULL) {
            ESP_LOGE(TAG, "create default WiFi STA netif failed");
            return 0;
        }
    }

