tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "esp_wifi_init failed: %s", esp_err_to_name(ret));
        return 0;
    }

    //ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_MIN_MODEM));
    //  test power only
    // ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_MAX_MODEM));
    //  test power only over

    //  test power only
    wifi_ps_type_t ps_type = WIFI_PS_NONE;
    esp_err_t ps_ret = esp_wifi_get_ps(&ps_type);
    ESP_LOGI(TAG, "PMDBG wifi_ps ret=%s type=%d, connected_ps=%d",
            esp_err_to_name(ps_ret),
            (int)ps_type,
            (int)SERVER_NETWORK_STA_CONNECTED_PS);
    //  test power only  over


    if (!s_wifi_handlers_registered) {
        ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                            ESP_EVENT_ANY_ID,
                                                            server_network_sta_event_handler,
                                                            NULL,
                                                            &s_wifi_event_instance));
        ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                            IP_EVENT_STA_GOT_IP,
                                                            server_network_sta_event_handler,
                                                            NULL,
                                                            &s_ip_event_instance));
        s_wifi_handlers_registered = true;
    }

    wifi_config_t wifi_config = {0};
    strlcpy((char *)wifi_config.sta.ssid, credential.ssid, sizeof(wifi_config.sta.ssid));
    strlcpy((char *)wifi_config.sta.password, credential.password, sizeof(wifi_config.sta.password));
    wifi_config.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
    wifi_config.sta.failure_retry_cnt = 5;
    wifi_config.sta.channel = SERVER_NETWORK_STA_WIFI_CHANNEL_HINT;
    wifi_config.sta.pmf_cfg.capable = true;
    wifi_config.sta.pmf_cfg.required = false;
#if SERVER_NETWORK_STA_DEBUG_LOG_ENABLE
    ESP_LOGI(TAG, "WiFi config ssid_len=%u pass_len=%u timeout_ms=%u scan=%d ch=%u fail_retry=%u pmf_req=%d",
             (unsigned int)strlen(credential.ssid),
             (unsigned int)strlen(credential.password),
             (unsigned int)SERVER_NETWORK_STA_CONNECT_TIMEOUT_MS,
             (int)wifi_config.sta.scan_method,
             (unsigned int)wifi_config.sta.channel,
             (unsigned int)wifi_config.sta.failure_retry_cnt,
             wifi_config.sta.pmf_cfg.required ? 1 : 0);
#endif

    // Force STA mode here so the migrated branch does not accidentally enter AP, PPP, OTA, or other network modes.
    // 在这里强制使�?STA 模式，避免移植分支误�?AP、PPP、OTA 或其它网络模式�?    (void)esp_wifi_disconnect();
    s_wifi_connect_active = false;
    s_wifi_scan_before_connect = false;
    server_network_sta_stop_retry_timer();
    ret = esp_wifi_stop();
    if (ret != ESP_OK && ret != ESP_ERR_WIFI_NOT_INIT && ret != ESP_ERR_WIFI_NOT_STARTED) {
        ESP_LOGE(TAG, "esp_wifi_stop failed: %s", esp_err_to_name(ret));
        return 0;
    }

    //  test power only
    //wifi_config.sta.listen_interval = 3;
    //  test power only over

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    s_wifi_connect_retry_num = 0;
    s_wifi_connect_start_tick = 0;
    xEventGroupClearBits(s_sta_event_group, SERVER_NETWORK_STA_CONNECTED_BIT | SERVER_NETWORK_STA_FAIL_BIT);
    server_network_sta_set_ps(WIFI_PS_NONE, "connecting");
    if (SERVER_NETWORK_STA_CONNECT_START_DELAY_MS > 0) {
        ESP_LOGI(TAG, "WiFi connect start delay_ms=%u", (unsigned int)SERVER_NETWORK_STA_CONNECT_START_DELAY_MS);
        vTaskDelay(pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_START_DELAY_MS));
    }

    s_wifi_connect_active = true;
    s_wifi_connect_start_tick = xTaskGetTickCount();
    s_wifi_scan_before_connect = SERVER_NETWORK_STA_SCAN_BEFORE_CONNECT != 0;
    ret = esp_wifi_start();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "esp_wifi_start failed: %s", esp_err_to_name(ret));
        s_wifi_connect_active = false;
        s_wifi_scan_before_connect = false;
        server_network_sta_stop_retry_timer();
        return 0;
    }

    bool connect_manually = (ret == ESP_ERR_INVALID_STATE);
#if SERVER_NETWORK_STA_SCAN_BEFORE_CONNECT
    server_network_sta_scan_target_ssid(credential.ssid);
    s_wifi_scan_before_connect = false;
    connect_manually = true;
#endif

    if (connect_manually) {
        ret = esp_wifi_connect();
        if (ret != ESP_OK && ret != ESP_ERR_WIFI_CONN) {
            ESP_LOGE(TAG, "esp_wifi_connect failed: %s", esp_err_to_name(ret));
            s_wifi_connect_active = false;
            server_network_sta_stop_retry_timer();
            return 0;
        }
    }

    EventBits_t bits = xEventGroupWaitBits(s_sta_event_group,
                                           SERVER_NETWORK_STA_CONNECTED_BIT | SERVER_NETWORK_STA_FAIL_BIT,
                                           pdTRUE,
                                           pdFALSE,
                                           pdMS_TO_TICKS(SERVER_NETWORK_STA_CONNECT_TIMEOUT_MS));
    if (bits & SERVER_NETWORK_STA_CONNECTED_BIT) {
        s_wifi_connect_active = false;
        server_network_sta_stop_retry_timer();
        //if(WiFi_config_net == true && (WiFi_config_from_ch583 == true || WiFi_config_from_ble == true))
        //if(WiFi_config_net == true) // anyway, send base info to mobile after connected, no need to check the source
        {
            ESP_LOGI(TAG, "send base info via %s",
                     WiFi_config_from_ch583 == true ? "CH583" : "BLE");
            send_base_info_to_mobile();
            WiFi_config_from_ch583 = false;
            WiFi_config_from_ble = false;

        }
        return 1;
    }

    s_wifi_connect_active = false;
    server_network_sta_stop_retry_timer();
    ESP_LOGE(TAG, "Server Network STA failed bits=0x%08lx", (unsigned long)bits);
    return 0;
}

static void Mdns_init_config(void)
{
    if (s_mdns_service_started) {
        return;
    }

