tdxguiping/ESP32_S3_epaper/main/server_network_sta/server_network_sta.c
    // Start mDNS after STA gets IP so the host name resolves only when the HTTP server can be reached.
    esp_err_t ret = mdns_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "mdns_init failed: %s", esp_err_to_name(ret));
        return;
    }
    ESP_ERROR_CHECK(mdns_hostname_set("esp32-s3-photopainter"));
    ESP_ERROR_CHECK(mdns_instance_name_set("ESP32-S3-WebServer"));
    ret = mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0);
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(TAG, "mdns_service_add failed: %s", esp_err_to_name(ret));
        return;
    }

    s_mdns_service_started = true;
    ESP_LOGI(TAG, "mDNS ready: http://esp32-s3-photopainter.local/index.html");
}

static esp_err_t ServerPort_init(const char *base_path)
{
    if (s_file_server_started) {
        return ESP_OK;
    }

    // Reuse the existing file_serving HTTP server so upload/download/delete behavior stays unchanged.
    esp_err_t ret = example_start_file_server(base_path);
    if (ret == ESP_OK) {
        s_file_server_started = true;
    }
    return ret;
}

static bool __attribute__((unused)) server_network_sta_skip_same_wifi(const wifi_credential_t *credential)
{
    wifi_config_t current_config = {0};
    wifi_ap_record_t ap_info = {0};
    esp_netif_ip_info_t ip_info = {0};
    wifi_ps_type_t ps_type = WIFI_PS_NONE;
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    bool same_config = false;
    bool connected = false;
    bool has_ip = false;

    if (credential == NULL || !credential->is_valid) {
        return false;
    }

    esp_err_t cfg_ret = esp_wifi_get_config(WIFI_IF_STA, &current_config);
    if (cfg_ret == ESP_OK) {
        same_config = strcmp((const char *)current_config.sta.ssid, credential->ssid) == 0 &&
                      strcmp((const char *)current_config.sta.password, credential->password) == 0;
    }

    esp_err_t ap_ret = esp_wifi_sta_get_ap_info(&ap_info);
    connected = (ap_ret == ESP_OK);

    if (netif != NULL && esp_netif_get_ip_info(netif, &ip_info) == ESP_OK) {
        has_ip = (ip_info.ip.addr != 0);
    }

    esp_err_t ps_ret = esp_wifi_get_ps(&ps_type);
    if (same_config && connected && has_ip) {
        ESP_LOGI(TAG,
                 "WiFi same credential ignored ssid=%s key=%s current_ssid=%s current_key=%s ip=" IPSTR " rssi=%d ch=%u ps=%d",
                 credential->ssid,
                 credential->password,
                 (const char *)current_config.sta.ssid,
                 (const char *)current_config.sta.password,
                 IP2STR(&ip_info.ip),
                 ap_info.rssi,
                 ap_info.primary,
                 ps_ret == ESP_OK ? (int)ps_type : -1);
        return true;
    }

    if (same_config) {
        ESP_LOGI(TAG,
                 "WiFi same credential but reconnect needed ssid=%s key=%s current_ssid=%s current_key=%s cfg=%s connected=%d ip=" IPSTR " ap_ret=%s",
                 credential->ssid,
                 credential->password,
                 (const char *)current_config.sta.ssid,
                 (const char *)current_config.sta.password,
                 esp_err_to_name(cfg_ret),
                 connected ? 1 : 0,
                 IP2STR(&ip_info.ip),
                 esp_err_to_name(ap_ret));
    }

    return false;
}

uint8_t User_Network_mode_app_init(const char *base_path)
{
    wifi_credential_t credential = server_network_sta_read_saved_wifi();

    // strcpy(credential.ssid,"MERCURY_A662");
    // strcpy(credential.password,"mnbv0123");

    if (!credential.is_valid) {
        ESP_LOGW(TAG, "No saved WiFi credential, return 0xA1");
        UserLedStatus_Set(USER_LED_STATE_WIFI_FAIL);

            {
                char reply_json[160];
                snprintf(reply_json, sizeof(reply_json),
                            "{\"result\":1,\"message\":\"wakeup No-WiFi\",\"stage\":\"error\"}");

                    #if(USER_BLE_ENABLE == 1)
                    SendData_indicate((uint8_t *)reply_json, strlen(reply_json));
                        // 杈撳嚭缁撴灉
                        printf("JSON:\n%s\n", reply_json);
                    #else
                    ch583_wifi_uart_send_wifi_data((const char *)reply_json);
                    #endif
            }


        return SERVER_NETWORK_STA_NO_SAVED_WIFI;
    }

    #if 0  
    if (server_network_sta_skip_same_wifi(&credential)) {
        Mdns_init_config();
        esp_err_t server_ret = ServerPort_init(base_path);
        if (server_ret != ESP_OK) {
            ESP_LOGE(TAG, "HTTP server start failed after skip reconnect: %s", esp_err_to_name(server_ret));
            UserLedStatus_Set(USER_LED_STATE_OPERATION_FAIL);
            return SERVER_NETWORK_STA_CONNECT_FAIL;
        }
        UserLedStatus_Set(USER_LED_STATE_SERVER_READY);
        return SERVER_NETWORK_STA_OK;
    }
    #endif

    uint8_t sta_ret = 0;
    for (int round = 1; round <= SERVER_NETWORK_STA_INIT_RETRY_ROUNDS; round++) {
        UserLedStatus_Set(USER_LED_STATE_WIFI_CONNECTING);
        ESP_LOGI(TAG, "WiFi connect round %d/%d", round, SERVER_NETWORK_STA_INIT_RETRY_ROUNDS);
        sta_ret = ServerPort_NetworkSTAInit(credential);
        if (sta_ret != 0) {
            break;
        }
        if (round < SERVER_NETWORK_STA_INIT_RETRY_ROUNDS) {
            ESP_LOGW(TAG,
                     "WiFi connect round failed, retry after %d ms",
                     SERVER_NETWORK_STA_INIT_RETRY_DELAY_MS);
            vTaskDelay(pdMS_TO_TICKS(SERVER_NETWORK_STA_INIT_RETRY_DELAY_MS));
        }
    }
    if (sta_ret == 0) {
        UserLedStatus_Set(USER_LED_STATE_WIFI_FAIL);
        return SERVER_NETWORK_STA_CONNECT_FAIL;
    }

    Mdns_init_config();

    esp_err_t server_ret = ServerPort_init(base_path);
    if (server_ret != ESP_OK) {
        ESP_LOGE(TAG, "HTTP server start failed: %s", esp_err_to_name(server_ret));
        UserLedStatus_Set(USER_LED_STATE_OPERATION_FAIL);
        return SERVER_NETWORK_STA_CONNECT_FAIL;
    }

    return SERVER_NETWORK_STA_OK;
}
